[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:109:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Personal Schedules Details</h1>
-        {personalSchedule && (
-          <PersonalSchedulesTable
-            personalSchedules={[personalSchedule]}
-            showButtons={false}
-          />
-        )}
+        {true}
         <h2>Sections in Personal Schedule</h2>
         {personalSection && (
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element by: [data-testid="PersonalSchedulesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:129:21
           data-testid="calendar-grid"
           style={{
             position: "relative",
-            height: "1000px", // Adjust based on your longest day
+            height: "", // Adjust based on your longest day
             margin: "20px 0",
             border: "1px solid #ddd",
killedBy: PersonalSchedulesDetailsPage tests calendar grid has expected style
statusReason: Error: expect(element).toHaveStyle()

- Expected

  border: 1px solid #ddd;
- height: 1000px;
  margin: 20px 0px;
  position: relative;

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:143:46
               overlay={
                 <Popover>
                   <Popover.Header as="h3">{event.title}</Popover.Header>
-                  <Popover.Body data-testid={`PopoverBody-${event.id}`}>
+                  <Popover.Body data-testid={``}>
                     <p>
                       {event.startTime} - {event.endTime}
killedBy: PersonalSchedulesDetailsPage tests clicking on an event shows a popover with details
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PopoverBody-0-0-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:154:30
               }
             >
               <Card
-                data-testid={`SchedulerEvent-${event.id}`}
+                data-testid={``}
                 style={event.style}
               >
killedBy: PersonalSchedulesDetailsPage tests displays visual schedule blocks with correct data
statusReason: Error: Unable to find an element by: [data-testid="/SchedulerEvent-/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:157:35
                 data-testid={`SchedulerEvent-${event.id}`}
                 style={event.style}
               >
-                <Card.Body style={{ padding: "5px" }}>
+                <Card.Body style={{}}>
                   {event.height >= 20 && (
                     <Card.Text
killedBy: PersonalSchedulesDetailsPage tests displays visual schedule blocks with correct data
statusReason: Error: expect(element).toHaveStyle()

- Expected

- padding: 5px;

[Killed] LogicalOperator
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:158:20
                 style={event.style}
               >
                 <Card.Body style={{ padding: "5px" }}>
-                  {event.height >= 20 && (
-                    <Card.Text
-                      data-testid={`SchedulerEventTitle-${event.id}`}
-                      style={event.titleStyle}
-                    >
-                      {event.title}
-                    </Card.Text>
-                  )}
+                  {event.height >= 20 || <Card.Text data-testid={`SchedulerEventTitle-${event.id}`} style={event.titleStyle}>
+                      {event.title}
+                    </Card.Text>}
                   {event.height >= 40 && (
                     <Card.Text
killedBy: PersonalSchedulesDetailsPage tests displays visual schedule blocks with correct data
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerEventTitle-0-0-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:158:20
                 style={event.style}
               >
                 <Card.Body style={{ padding: "5px" }}>
-                  {event.height >= 20 && (
+                  {event.height < 20 && (
                     <Card.Text
                       data-testid={`SchedulerEventTitle-${event.id}`}
killedBy: PersonalSchedulesDetailsPage tests displays visual schedule blocks with correct data
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="SchedulerEventTitle-0-0-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:166:20
                       {event.title}
                     </Card.Text>
                   )}
-                  {event.height >= 40 && (
-                    <Card.Text
-                      data-testid={`SchedulerEventTime-${event.id}`}
-                      style={{ fontSize: "12px", textAlign: "left" }}
-                    >
-                      {event.startTime} - {event.endTime}
-                    </Card.Text>
-                  )}
+                  {event.height >= 40 || <Card.Text data-testid={`SchedulerEventTime-${event.id}`} style={{
+  fontSize: "12px",
+  textAlign: "left"
+}}>
+                      {event.startTime} - {event.endTime}
+                    </Card.Text>}
                 </Card.Body>
               </Card>
killedBy: PersonalSchedulesDetailsPage tests renders event title and time based on height thresholds
statusReason: Error: Unable to find an element by: [data-testid="SchedulerEventTime-0-0-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:166:20
                       {event.title}
                     </Card.Text>
                   )}
-                  {event.height >= 40 && (
-                    <Card.Text
-                      data-testid={`SchedulerEventTime-${event.id}`}
-                      style={{ fontSize: "12px", textAlign: "left" }}
-                    >
-                      {event.startTime} - {event.endTime}
-                    </Card.Text>
-                  )}
+                  {false}
                 </Card.Body>
               </Card>
killedBy: PersonalSchedulesDetailsPage tests renders event title and time based on height thresholds
statusReason: Error: Unable to find an element by: [data-testid="SchedulerEventTime-0-0-0"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:169:30
                   {event.height >= 40 && (
                     <Card.Text
                       data-testid={`SchedulerEventTime-${event.id}`}
-                      style={{ fontSize: "12px", textAlign: "left" }}
+                      style={{}}
                     >
                       {event.startTime} - {event.endTime}
killedBy: PersonalSchedulesDetailsPage tests correctly positions events based on time conversion
statusReason: Error: expect(element).toHaveStyle()

- Expected

- font-size: 12px;

Ignored nodes: comments, script, style
<html>

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:169:61
                   {event.height >= 40 && (
                     <Card.Text
                       data-testid={`SchedulerEventTime-${event.id}`}
-                      style={{ fontSize: "12px", textAlign: "left" }}
+                      style={{ fontSize: "12px", textAlign: "" }}
                     >
                       {event.startTime} - {event.endTime}
killedBy: PersonalSchedulesDetailsPage tests correctly positions events based on time conversion
statusReason: Error: expect(element).toHaveStyle()

- Expected

- text-align: left;

Ignored nodes: comments, script, style
<html>
