[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:33:51
     "ASC",
   );
 
-  const [pageSize, setPageSize] = useLocalStorage("JobsSearch.PageSize", "5");
+  const [pageSize, setPageSize] = useLocalStorage("", "5");
 
   // test job
killedBy: AdminJobsPage tests When localstorage is empty, fallback values are used
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 2

  Object {
-   "JobsSearch.PageSize,5": 4,
+   ",5": 2,

[Killed] StringLiteral
main/pages/Admin/AdminJobsPage.js:73:13
 
   const objectToAxiosParamsUpdateCoursesJob = (data) => ({
     url: `/api/jobs/launch/updateCourses?quarterYYYYQ=${data.quarter}&subjectArea=${data.subject}&ifStale=${data.ifStale}`,
-    method: "POST",
+    method: "",
   });
 
killedBy: AdminJobsPage tests user can submit the update course data job
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

Ignored nodes: comments, script, style
<html>
  <head />
