[Survived] ArithmeticOperator
main/components/EnrollmentData/EnrollmentHistoryGraph.js:68:25
     grade,
     count: gradeCounts[grade] || 0,
     percentage:
-      totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
+      totalCount > 0 ? ((gradeCounts[grade] || 0) * totalCount) * 100 : 0,
   }));
 };

[Survived] ConditionalExpression
main/components/EnrollmentData/EnrollmentHistoryGraph.js:68:26
     grade,
     count: gradeCounts[grade] || 0,
     percentage:
-      totalCount > 0 ? ((gradeCounts[grade] || 0) / totalCount) * 100 : 0,
+      totalCount > 0 ? ((true) / totalCount) * 100 : 0,
   }));
 };

[Survived] UpdateOperator
main/components/EnrollmentData/EnrollmentHistoryGraph.js:85:44
 
   var data_list = [];
 
-  for (let index = 0; index < data.length; index++) {
+  for (let index = 0; index < data.length; index--) {
     const element = data[index];
     data_list.push(element.enrollment, element.dateCreated)

[Survived] ConditionalExpression
main/components/EnrollmentData/EnrollmentHistoryGraph.js:85:23
 
   var data_list = [];
 
-  for (let index = 0; index < data.length; index++) {
+  for (let index = 0; false; index++) {
     const element = data[index];
     data_list.push(element.enrollment, element.dateCreated)

[Survived] MethodExpression
main/components/EnrollmentData/EnrollmentHistoryGraph.js:112:28
 
   // Added sort function to be able to display data by most recent quarter
   data.sort((a, b) => {
-    const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
+    const [yearA, qtrA] = [a.yyyyq, a.yyyyq[4]];
     const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
 

[Survived] BlockStatement
main/components/EnrollmentData/EnrollmentHistoryGraph.js:115:26
     const [yearA, qtrA] = [a.yyyyq.slice(0, 4), a.yyyyq[4]];
     const [yearB, qtrB] = [b.yyyyq.slice(0, 4), b.yyyyq[4]];
 
-    if (yearA !== yearB) {
-      return yearB - yearA;
-    } else {
+    if (yearA !== yearB) {} else {
       return qtrB - qtrA;
     }

[Survived] ArithmeticOperator
main/components/EnrollmentData/EnrollmentHistoryGraph.js:118:14
     if (yearA !== yearB) {
       return yearB - yearA;
     } else {
-      return qtrB - qtrA;
+      return qtrB + qtrA;
     }
   });

[Survived] ConditionalExpression
main/components/EnrollmentData/EnrollmentHistoryGraph.js:124:9
 
   data.forEach((item) => {
     const key = `${item.yyyyq}-${item.instructor}`;
-    if (!groupedData[key]) {
+    if (false) {
       groupedData[key] = [];
     }

[Survived] ArrayDeclaration
main/components/EnrollmentData/EnrollmentHistoryGraph.js:125:26
   data.forEach((item) => {
     const key = `${item.yyyyq}-${item.instructor}`;
     if (!groupedData[key]) {
-      groupedData[key] = [];
+      groupedData[key] = ["Stryker was here"];
     }
     groupedData[key].push(item);
