[Survived] BlockStatement
main/pages/EnrollmentData/EnrollmentDataGraphPage.js:3:51
 import BasicLayout from "main/layouts/BasicLayout/BasicLayout";
 
-export default function EnrollmentDataGraphPage() {
-  // Stryker disable all : placeholder for future implementation
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Graph page not yet implemented</h1>
-        <p>
-          <a href="/enrollmentdata/search">Search</a>
-        </p>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function EnrollmentDataGraphPage() {}
 
