[Killed] BlockStatement
src/main/utils/enrollmentDataUtils.js:8:47
   toast(message);
 }
 
-export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/enrollmentdata",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
-}
+export function cellToAxiosParamsDelete(cell) {}
 
killedBy: enrollmentDataUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "DELETE", "params": {"id": 17}, "url": "/api/enrollmentdata"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/enrollmentDataUtils.js:9:10
 }
 
 export function cellToAxiosParamsDelete(cell) {
-  return {
-    url: "/api/enrollmentdata",
-    method: "DELETE",
-    params: {
-      id: cell.row.values.id,
-    },
-  };
+  return {};
 }
 
killedBy: enrollmentDataUtils cellToAxiosParamsDelete It returns the correct params
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 7
+ Received  + 1

- Object {
-   "method": "DELETE",
-   "params": Object {
