[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:19:3
 import React, { useEffect, useState } from "react";
 
 const daysOfWeek = [
-  "Monday",
+  "",
   "Tuesday",
   "Wednesday",
killedBy: PersonalSchedulesDetailsPage tests displays visual schedule blocks with correct data
statusReason: Error: Unable to find an element by: [data-testid="/SchedulerEvent-/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrayDeclaration
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:28:15
   "Sunday",
 ];
 
-const hours = [
-  "",
-  "6 AM",
-  "7 AM",
-  "8 AM",
-  "9 AM",
-  "10 AM",
-  "11 AM",
-  "12 PM",
-  "1 PM",
-  "2 PM",
-  "3 PM",
-  "4 PM",
-  "5 PM",
-  "6 PM",
-  "7 PM",
-  "8 PM",
-  "9 PM",
-  "10 PM",
-];
+const hours = [];
 
 export default function PersonalSchedulesDetailsPage() {
killedBy: PersonalSchedulesDetailsPage tests renders weekly calendar with all days and hours
statusReason: TestingLibraryElementError: Unable to find an element with the text: 6 AM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:34:3
   "7 AM",
   "8 AM",
   "9 AM",
-  "10 AM",
+  "",
   "11 AM",
   "12 PM",
killedBy: PersonalSchedulesDetailsPage tests renders weekly calendar with all days and hours
statusReason: TestingLibraryElementError: Unable to find an element with the text: 10 AM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:154:24
   }, [personalSection]);
   // Stryker restore all
 
-  const createButton = () => (
-    <Button variant="primary" href="/personalschedules/list">
-      Back
-    </Button>
-  );
+  const createButton = () => undefined;
 
   return (
killedBy: PersonalSchedulesDetailsPage tests renders 'Back' button and tests its functionality
statusReason: TestingLibraryElementError: Unable to find an accessible element with the role "button" and name `/back/i`

Here are the accessible roles:

  navigation:

  Name "":
  <nav

[Killed] LogicalOperator
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:164:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Personal Schedules Details</h1>
-        {personalSchedule && (
-          <PersonalSchedulesTable
-            personalSchedules={[personalSchedule]}
-            showButtons={false}
-          />
-        )}
+        {personalSchedule || <PersonalSchedulesTable personalSchedules={[personalSchedule]} showButtons={false} />}
         <h2>Sections in Personal Schedule</h2>
         {personalSection && (
killedBy: PersonalSchedulesDetailsPage tests renders without crashing for regular user
statusReason: Error: Invalid data value

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:164:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Personal Schedules Details</h1>
-        {personalSchedule && (
-          <PersonalSchedulesTable
-            personalSchedules={[personalSchedule]}
-            showButtons={false}
-          />
-        )}
+        {false}
         <h2>Sections in Personal Schedule</h2>
         {personalSection && (
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element by: [data-testid="PersonalSchedulesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BooleanLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:167:26
         {personalSchedule && (
           <PersonalSchedulesTable
             personalSchedules={[personalSchedule]}
-            showButtons={false}
+            showButtons={true}
           />
         )}
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Error: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <button class="btn btn-danger" data-testid="PersonalSchedulesTable-cell-row-0-col-Delete-button" type="button">Delete</button> instead

Ignored nodes: comments, script, style
<html>
  <head />
  <body>

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:171:10
           />
         )}
         <h2>Sections in Personal Schedule</h2>
-        {personalSection && (
-          <PersonalSectionsTable
-            personalSections={personalSection}
-            psId={id}
-            currentUser={currentUser}
-          />
-        )}
+        {true}
 
         {/* Optional visual scheduler block (from SchedulerEvents logic) */}
killedBy: PersonalSchedulesDetailsPage tests shows the correct info for admin users
statusReason: Error: Unable to find an element by: [data-testid="PersonalSectionsTable-cell-row-0-col-courseId"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:171:10
           />
         )}
         <h2>Sections in Personal Schedule</h2>
-        {personalSection && (
-          <PersonalSectionsTable
-            personalSections={personalSection}
-            psId={id}
-            currentUser={currentUser}
-          />
-        )}
+        {personalSection || <PersonalSectionsTable personalSections={personalSection} psId={id} currentUser={currentUser} />}
 
         {/* Optional visual scheduler block (from SchedulerEvents logic) */}
killedBy: PersonalSchedulesDetailsPage tests renders without crashing for regular user
statusReason: Error: Invalid data value

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:182:18
         {/* Optional visual scheduler block (from SchedulerEvents logic) */}
         <div
           data-testid="calendar-grid"
-          style={{
-            position: "relative",
-            height: "1500px",
-            margin: "20px 0",
-            border: "1px solid #ddd",
-          }}
+          style={{}}
         >
           <h2 className="mt-4 text-center">Weekly View</h2>
killedBy: PersonalSchedulesDetailsPage tests calendar grid has expected style
statusReason: Error: expect(element).toHaveStyle()

- Expected

- border: 1px solid #ddd;
- height: 1500px;
- margin: 20px 0px;
- position: relative;

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:183:23
         <div
           data-testid="calendar-grid"
           style={{
-            position: "relative",
+            position: "",
             height: "1500px",
             margin: "20px 0",
killedBy: PersonalSchedulesDetailsPage tests calendar grid has expected style
statusReason: Error: expect(element).toHaveStyle()

- Expected

  border: 1px solid #ddd;
  height: 1500px;
  margin: 20px 0px;
- position: relative;

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:184:21
           data-testid="calendar-grid"
           style={{
             position: "relative",
-            height: "1500px",
+            height: "",
             margin: "20px 0",
             border: "1px solid #ddd",
killedBy: PersonalSchedulesDetailsPage tests calendar grid has expected style
statusReason: Error: expect(element).toHaveStyle()

- Expected

  border: 1px solid #ddd;
- height: 1500px;
  margin: 20px 0px;
  position: relative;

[Killed] MethodExpression
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:200:24
                       <Card.Body>
                         <Card.Title style={styles.dayTitle}>{day}</Card.Title>
                       </Card.Body>
-                      {eventStyles
-                        .filter((event) => event.day === day)
+                      {eventStyles
                         .map((event) => (
                           <OverlayTrigger
killedBy: PersonalSchedulesDetailsPage tests displays visual schedule blocks with correct data
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="SchedulerEventTitle-0-0-0-M"]

Here are the matching elements:

Ignored nodes: comments, script, style
<p
  class="card-text"
  data-testid="SchedulerEventTitle-0-0-0-M"

[Killed] EqualityOperator
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:201:44
                         <Card.Title style={styles.dayTitle}>{day}</Card.Title>
                       </Card.Body>
                       {eventStyles
-                        .filter((event) => event.day === day)
+                        .filter((event) => event.day !== day)
                         .map((event) => (
                           <OverlayTrigger
killedBy: PersonalSchedulesDetailsPage tests displays visual schedule blocks with correct data
statusReason: TestingLibraryElementError: Found multiple elements by: [data-testid="SchedulerEventTitle-0-0-0-M"]

Here are the matching elements:

Ignored nodes: comments, script, style
<p
  class="card-text"
  data-testid="SchedulerEventTitle-0-0-0-M"

[Killed] ConditionalExpression
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:201:44
                         <Card.Title style={styles.dayTitle}>{day}</Card.Title>
                       </Card.Body>
                       {eventStyles
-                        .filter((event) => event.day === day)
+                        .filter((event) => false)
                         .map((event) => (
                           <OverlayTrigger
killedBy: PersonalSchedulesDetailsPage tests displays visual schedule blocks with correct data
statusReason: Error: Unable to find an element by: [data-testid="/SchedulerEvent-/"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:214:48
                                   {event.title}
                                 </Popover.Header>
                                 <Popover.Body
-                                  data-testid={`PopoverBody-${event.id}`}
+                                  data-testid={``}
                                 >
                                   <p>
killedBy: PersonalSchedulesDetailsPage tests clicking on an event shows a popover with details
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="PopoverBody-0-0-0-M"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] LogicalOperator
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:236:34
                                 >
                                   {event.title}
                                 </Card.Text>
-                                {event.height >= 40 && (
-                                  <Card.Text
-                                    data-testid={`SchedulerEventTime-${event.id}`}
-                                    style={{
-                                      fontSize: "12px",
-                                      textAlign: "center",
-                                    }}
-                                  >
-                                    {event.startTime} - {event.endTime}
-                                  </Card.Text>
-                                )}
+                                {event.height >= 40 || <Card.Text data-testid={`SchedulerEventTime-${event.id}`} style={{
+  fontSize: "12px",
+  textAlign: "center"
+}}>
+                                    {event.startTime} - {event.endTime}
+                                  </Card.Text>}
                               </Card.Body>
                             </Card>
killedBy: PersonalSchedulesDetailsPage tests renders event title and time based on height thresholds
statusReason: Error: Unable to find an element by: [data-testid="SchedulerEventTime-0-0-0-M"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] EqualityOperator
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:236:34
                                 >
                                   {event.title}
                                 </Card.Text>
-                                {event.height >= 40 && (
+                                {event.height < 40 && (
                                   <Card.Text
                                     data-testid={`SchedulerEventTime-${event.id}`}
killedBy: PersonalSchedulesDetailsPage tests renders event title and time based on height thresholds
statusReason: Error: Unable to find an element by: [data-testid="SchedulerEventTime-0-0-0-M"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:239:44
                                 {event.height >= 40 && (
                                   <Card.Text
                                     data-testid={`SchedulerEventTime-${event.id}`}
-                                    style={{
-                                      fontSize: "12px",
-                                      textAlign: "center",
-                                    }}
+                                    style={{}}
                                   >
                                     {event.startTime} - {event.endTime}
killedBy: PersonalSchedulesDetailsPage tests event time element has correct fontSize and textAlign styles
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "12px"
Received: ""

[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:260:30
                   <div
                     style={{ ...styles.timeSlot, height: "30px", border: "0" }}
                   ></div>
-                  {hours.map((hour, index) => (
-                    <div
-                      key={index}
-                      style={{ ...styles.timeSlot, border: "0" }}
-                    >
-                      <span style={styles.hourLabel}>{hour}</span>
-                    </div>
-                  ))}
+                  {hours.map(() => undefined)}
                 </Col>
                 {daysOfWeek.map((day) => (
killedBy: PersonalSchedulesDetailsPage tests renders weekly calendar with all days and hours
statusReason: TestingLibraryElementError: Unable to find an element with the text: 6 AM. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:263:60
                   {hours.map((hour, index) => (
                     <div
                       key={index}
-                      style={{ ...styles.timeSlot, border: "0" }}
+                      style={{ ...styles.timeSlot, border: "" }}
                     >
                       <span style={styles.hourLabel}>{hour}</span>
killedBy: PersonalSchedulesDetailsPage tests time label column has top spacer and hour rows with correct border and height styles
statusReason: Error: expect(received).toMatch(expected)

Expected pattern: /^0(px)?$/
Received string:  ""

[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:269:33
                     </div>
                   ))}
                 </Col>
-                {daysOfWeek.map((day) => (
-                  <Col key={day} style={styles.dayColumn}>
-                    <div style={{ ...styles.timeSlot, height: "30px" }}></div>
-                    {hours.slice(0, hours.length - 1).map((_, index) => (
-                      <div key={index} style={styles.timeSlot}>
-                        <Card style={styles.eventCard} />
-                      </div>
-                    ))}
-                  </Col>
-                ))}
+                {daysOfWeek.map(() => undefined)}
               </Row>
             </Container>
killedBy: PersonalSchedulesDetailsPage tests each day column renders a top spacer div with height 30px
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 1

[Killed] ObjectLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:271:33
                 </Col>
                 {daysOfWeek.map((day) => (
                   <Col key={day} style={styles.dayColumn}>
-                    <div style={{ ...styles.timeSlot, height: "30px" }}></div>
+                    <div style={{}}></div>
                     {hours.slice(0, hours.length - 1).map((_, index) => (
                       <div key={index} style={styles.timeSlot}>
killedBy: PersonalSchedulesDetailsPage tests each day column renders a top spacer div with height 30px
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 1

[Killed] StringLiteral
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:271:63
                 </Col>
                 {daysOfWeek.map((day) => (
                   <Col key={day} style={styles.dayColumn}>
-                    <div style={{ ...styles.timeSlot, height: "30px" }}></div>
+                    <div style={{ ...styles.timeSlot, height: "" }}></div>
                     {hours.slice(0, hours.length - 1).map((_, index) => (
                       <div key={index} style={styles.timeSlot}>
killedBy: PersonalSchedulesDetailsPage tests each day column renders a top spacer div with height 30px
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 8
Received: 1

[Killed] ArrowFunction
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:272:59
                 {daysOfWeek.map((day) => (
                   <Col key={day} style={styles.dayColumn}>
                     <div style={{ ...styles.timeSlot, height: "30px" }}></div>
-                    {hours.slice(0, hours.length - 1).map((_, index) => (
-                      <div key={index} style={styles.timeSlot}>
-                        <Card style={styles.eventCard} />
-                      </div>
-                    ))}
+                    {hours.slice(0, hours.length - 1).map(() => undefined)}
                   </Col>
                 ))}
killedBy: PersonalSchedulesDetailsPage tests renders correct number of empty time slots and time slots per day
statusReason: Error: expect(received).toBeGreaterThanOrEqual(expected)

Expected: >= 119
Received:    18

[Killed] ArithmeticOperator
main/pages/PersonalSchedules/PersonalSchedulesDetailsPage.js:272:37
                 {daysOfWeek.map((day) => (
                   <Col key={day} style={styles.dayColumn}>
                     <div style={{ ...styles.timeSlot, height: "30px" }}></div>
-                    {hours.slice(0, hours.length - 1).map((_, index) => (
+                    {hours.slice(0, hours.length + 1).map((_, index) => (
                       <div key={index} style={styles.timeSlot}>
                         <Card style={styles.eventCard} />
killedBy: PersonalSchedulesDetailsPage tests renders correct number of empty time slots and time slots per day
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 119
Received: 126
