[Killed] BlockStatement
main/components/Classrooms/SingleClassroomDropdown.js:24:19
 
   const [classrooms, setClassrooms] = useState([]);
 
-  useEffect(() => {
-    if (buildingCode) {
-      axios
-        .get("/api/public/classrooms/roomnumbers", {
-          params: { quarter, buildingCode },
-        })
-        .then((response) => {
-          const sorted = [...response.data].sort((a, b) => a.localeCompare(b));
-          setClassrooms(sorted);
-        })
-        .catch((error) => {
-          console.error("Error fetching classrooms:", error);
-        });
-    }
-  }, [buildingCode, quarter]);
+  useEffect(() => {}, [buildingCode, quarter]);
 
   const handleClassroomOnChange = (event) => {
killedBy: SingleClassroomDropdown tests shows sorted classroom options with hyphenated keys and correct order
statusReason: Error: Unable to find an element by: [data-testid="scd1-option-1116"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] ConditionalExpression
main/components/Classrooms/SingleClassroomDropdown.js:25:9
   const [classrooms, setClassrooms] = useState([]);
 
   useEffect(() => {
-    if (buildingCode) {
+    if (false) {
       axios
         .get("/api/public/classrooms/roomnumbers", {
killedBy: SingleClassroomDropdown tests shows sorted classroom options with hyphenated keys and correct order
statusReason: Error: Unable to find an element by: [data-testid="scd1-option-1116"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] ConditionalExpression
main/components/Classrooms/SingleClassroomDropdown.js:25:9
   const [classrooms, setClassrooms] = useState([]);
 
   useEffect(() => {
-    if (buildingCode) {
+    if (true) {
       axios
         .get("/api/public/classrooms/roomnumbers", {
killedBy: SingleClassroomDropdown tests does not fetch classrooms when buildingCode is missing
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "/api/public/classrooms/roomnumbers", {"params": {"buildingCode": "", "quarter": "20221"}}

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Classrooms/SingleClassroomDropdown.js:30:29
         .get("/api/public/classrooms/roomnumbers", {
           params: { quarter, buildingCode },
         })
-        .then((response) => {
-          const sorted = [...response.data].sort((a, b) => a.localeCompare(b));
-          setClassrooms(sorted);
-        })
+        .then((response) => {})
         .catch((error) => {
           console.error("Error fetching classrooms:", error);
killedBy: SingleClassroomDropdown tests shows sorted classroom options with hyphenated keys and correct order
statusReason: Error: Unable to find an element by: [data-testid="scd1-option-1116"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"

[Killed] MethodExpression
main/components/Classrooms/SingleClassroomDropdown.js:31:26
           params: { quarter, buildingCode },
         })
         .then((response) => {
-          const sorted = [...response.data].sort((a, b) => a.localeCompare(b));
+          const sorted = [...response.data];
           setClassrooms(sorted);
         })
killedBy: SingleClassroomDropdown tests classrooms are sorted alphabetically
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   "2220",
    "1110",

[Killed] ArrowFunction
main/components/Classrooms/SingleClassroomDropdown.js:31:50
           params: { quarter, buildingCode },
         })
         .then((response) => {
-          const sorted = [...response.data].sort((a, b) => a.localeCompare(b));
+          const sorted = [...response.data].sort(() => undefined);
           setClassrooms(sorted);
         })
killedBy: SingleClassroomDropdown tests classrooms are sorted alphabetically
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
+   "2220",
    "1110",

[Killed] BlockStatement
main/components/Classrooms/SingleClassroomDropdown.js:34:27
           const sorted = [...response.data].sort((a, b) => a.localeCompare(b));
           setClassrooms(sorted);
         })
-        .catch((error) => {
-          console.error("Error fetching classrooms:", error);
-        });
+        .catch((error) => {});
     }
   }, [buildingCode, quarter]);
killedBy: SingleClassroomDropdown tests gracefully handles axios failure
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "Error fetching classrooms:", Any<Error>

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] BlockStatement
main/components/Classrooms/SingleClassroomDropdown.js:40:46
     }
   }, [buildingCode, quarter]);
 
-  const handleClassroomOnChange = (event) => {
-    localStorage.setItem(controlId, event.target.value);
-    setClassroomState(event.target.value);
-    setClassroom(event.target.value);
-    if (onChange != null) {
-      onChange(event);
-    }
-  };
+  const handleClassroomOnChange = (event) => {};
 
   return (
killedBy: SingleClassroomDropdown tests calls setClassroom and onChange when selection changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "2210"

Number of calls: 0

Ignored nodes: comments, script, style
<html>

[Killed] ConditionalExpression
main/components/Classrooms/SingleClassroomDropdown.js:44:9
     localStorage.setItem(controlId, event.target.value);
     setClassroomState(event.target.value);
     setClassroom(event.target.value);
-    if (onChange != null) {
+    if (false) {
       onChange(event);
     }
killedBy: SingleClassroomDropdown tests calls setClassroom and onChange when selection changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] BlockStatement
main/components/Classrooms/SingleClassroomDropdown.js:44:27
     localStorage.setItem(controlId, event.target.value);
     setClassroomState(event.target.value);
     setClassroom(event.target.value);
-    if (onChange != null) {
-      onChange(event);
-    }
+    if (onChange != null) {}
   };
 
killedBy: SingleClassroomDropdown tests calls setClassroom and onChange when selection changes
statusReason: Error: expect(jest.fn()).toHaveBeenCalledTimes(expected)

Expected number of calls: 1
Received number of calls: 0

Ignored nodes: comments, script, style
<html>
  <head />

[Killed] ConditionalExpression
main/components/Classrooms/SingleClassroomDropdown.js:58:10
         onChange={handleClassroomOnChange}
       >
         <option value="">Select a classroom</option>
-        {showAll && (
-          <option data-testid={`${controlId}-option-all`} value="ALL">
-            ALL
-          </option>
-        )}
+        {true}
         {classrooms.map((room) => {
           const key = `${controlId}-option-${room.replace(/ /g, "-")}`;
killedBy: SingleClassroomDropdown tests renders "ALL" option when showAll is true
statusReason: Error: expect(received).toBeInTheDocument()

received value must be an HTMLElement or an SVGElement.
Received has value: null

[Killed] LogicalOperator
main/components/Classrooms/SingleClassroomDropdown.js:58:10
         onChange={handleClassroomOnChange}
       >
         <option value="">Select a classroom</option>
-        {showAll && (
-          <option data-testid={`${controlId}-option-all`} value="ALL">
-            ALL
-          </option>
-        )}
+        {showAll || <option data-testid={`${controlId}-option-all`} value="ALL">
+            ALL
+          </option>}
         {classrooms.map((room) => {
           const key = `${controlId}-option-${room.replace(/ /g, "-")}`;
killedBy: SingleClassroomDropdown tests shows sorted classroom options with hyphenated keys and correct order
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 1

  Array [
+   "ALL",
    "1116",

[Killed] BlockStatement
main/components/Classrooms/SingleClassroomDropdown.js:63:35
             ALL
           </option>
         )}
-        {classrooms.map((room) => {
-          const key = `${controlId}-option-${room.replace(/ /g, "-")}`;
-          return (
-            <option key={key} data-testid={key} value={room}>
-              {room}
-            </option>
-          );
-        })}
+        {classrooms.map((room) => {})}
       </Form.Control>
     </Form.Group>
killedBy: SingleClassroomDropdown tests shows sorted classroom options with hyphenated keys and correct order
statusReason: Error: Unable to find an element by: [data-testid="scd1-option-1116"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div>
      <label
        class="form-label"
